# List of explicitly installed pacman packages
# Generated on Mon May  5 08:34:52 PM CST 2025
# Format: package_name
alacritty
amd-ucode
arandr
arch-install-scripts
aws-cli
base
base-devel
bash-completion
bat
bind
blueberry
bluez-utils
borg
bottom
btop
chezmoi
clamav
cloudflared
cronie
cups
darkman
deepin-screen-recorder
dhclient
dmenu
docker
docker-buildx
docker-compose
doomretro
dunst
efibootmgr
element-desktop
exa
fd
feh
fff
firefox
flameshot
fzf
git
gnome-disk-utility
gnome-keyring
gnome-themes-extra
gpg
grub
gst-plugin-pipewire
gtk2
hplip
htop
i3-wm
i3blocks
i3lock
i3status
intel-media-driver
intel-ucode
ipcalc
iwd
jq
kdeconnect
keychain
krita
lazygit
libmicrodns
libpng12
libpulse
libva-intel-driver
lightdm
lightdm-gtk-greeter
lightdm-slick-greeter
linux
linux-firmware
luarocks
man-db
man-pages
mtr
nano
ncdu
neofetch
neovim
netstat-nat
network-manager-applet
networkmanager
nginx
nmap
nodejs
npm
obs-studio
obsidian
openresolv
openssh
optipng
pass
pavucontrol
picom
pipewire
pipewire-alsa
pipewire-jack
pm2
pngquant
procs
pulseaudio-bluetooth
python
python-pip
python-poetry
python-setuptools
python-virtualenv
qbittorrent
ranger
ripgrep
rofi
rsync
sl
smartmontools
sof-firmware
starship
steam
strace
tldr
translate-shell
ttf-fira-code
ttf-firacode-nerd
ttf-font-awesome
ttf-hack
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-roboto
ttf-ubuntu-font-family
ueberzug
ufw
unzip
vim
vlc
vulkan-intel
vulkan-radeon
wget
wireguard-tools
wireless_tools
wireplumber
wpa_supplicant
xclip
xdg-utils
xf86-video-amdgpu
xf86-video-ati
xf86-video-intel
xf86-video-nouveau
xf86-video-vmware
xorg-server-devel
xorg-xdpyinfo
xorg-xinit
xorg-xwininfo
xournalpp
xss-lock
xterm
yarn
zoxide
zram-generator
zsh
